import React, { useState } from 'react';
import style from './syle.module.css'
const Morning = () => {
  const [isExpanded, setIsExpanded] = useState(false);
  const [showReference, setShowReference] = useState(false);
  const [showTranslation, setShowTranslation] = useState(false);

  const handleExpandClick = () => {
    setIsExpanded(!isExpanded);
  };

  const handleReferenceClick = () => {
    setShowReference(!showReference);
  };

  const handleTranslationClick = () => {
    setShowTranslation(!showTranslation);
  };

  return (
    <div  className={style.block}>
      <h1 onClick={handleExpandClick} style={{ cursor: 'pointer' }}>
        രാവിലെ പതിവാക്കേണ്ട ദുആകളും ദിക്റുകളും
      </h1>
      {isExpanded && (
        <div>
          <p>الْحَمْدُ لِلهِ وَحْدَهُ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى مَنْ لاَ نَبِيَّ بَعْدَهُ.1</p>

          <button onClick={handleTranslationClick}>
            {showTranslation ? 'Hide Translation' : 'Show Translation'}
          </button>
          {showTranslation && <p>എ‌ല്ലാ സ്‌‌തു‌തി‌യും അ‌ല്ലാ‌ഹു‌വി‌നാ‌ണ്‌; ശേ‌ഷം വേ‌റൊ‌രു ന‌ബി വ‌രാ‌നി‌ല്ലാ‌ത്ത ന‌ബി (മു‌ഹ‌മ്മദ്‌ ﷺ)യു‌ടെ മേൽ അ‌ല്ലാ‌ഹു‌വി‌ന്റെ അ‌നു‌ഗ്ര‌ഹ‌വും സ‌മാ‌ധാ‌ന‌വു‌മു‌ണ്ടാ‌വ‌ട്ടെ.</p>}

          <button onClick={handleReferenceClick}>
            {showReference ? 'Hide Reference' : 'Show Reference'}
          </button>
          {showReference && <p>അ‌ല്ലാ‌ഹു പ‌റ‌യു‌ന്നു: “നി‌ന്റെ റ‌ബ്ബി‌നെ നീ വ‌ള‌രെ‌യ‌ധി‌കം ഓർ‌ക്കു‌ക. ‘വൈ‌കു‌ന്നേ‌ര‌വും രാവിലേയും’ അ‌വ‌ന്റെ ‌മ‌ഹ‌ത്വ‌വും പ‌രി‌ശു‌ദ്ധി‌യും നീ സ്‌‌തു‌തി‌ച്ചു വാ‌ഴ്‌ത്തു‌ക.” (ആലുഇംറാൻ: 41)
            <p>നി‌ന്റെ പാ‌പ‌ത്തി‌ന്‌ നീ മാ‌പ്പു‌തേ‌ടു‌ക‌യും (പാ‌പ‌മോ‌ച‌ന‌ത്തി‌നും അ‌നു‌ഗ്ര‌ഹ‌ത്തി‌നു‌മായി) രാവിലേയും വൈ‌കു‌ന്നേ‌ര‌വും നി‌ന്റെ റ‌ബ്ബി‌ന്റെ മ‌ഹ‌ത്വ‌വും പ‌രി‌ശു‌ദ്ധി‌യും നീ സ്‌‌തു‌തി‌ച്ചു വാ‌ഴ്‌‌ത്തു‌ക‌യും ചെ‌യ്യു‌ക.” (ഗാഫിർ: 55)</p>
                <p>ന‌ബി ﷺ പ‌റ‌ഞ്ഞു: “അ‌ല്ലാ‌ഹു‌വി‌ന്‌ ദി‌ക്‌‌റ്‌ ചൊ‌ല്ലി‌ക്കൊ‌ണ്ട്‌ (എ‌ല്ലാ ദി‌വ‌സ‌വും) രാ‌വി‌ലെ സുബ്‌ഹ് ന‌മ‌സ്‌‌കാ‌ര‌ശേ‌ഷം സൂ‌ര്യൻ ഉ‌ദി‌ച്ചു‌പൊ‌ങ്ങു‌ന്ന‌തു‌വ‌രെ ഇ‌രി‌ക്കു‌ന്ന‌വ‌രെ പോ‌ലെ ദി‌ക്‌‌റ്‌ ചൊ‌ല്ലി ഇ‌രി‌ക്കു‌വാ‌നാ‌ണ്‌ എ‌നി‌ക്ക്‌ ഇ‌സ്‌‌മാ‌ഈൽ സ‌ന്ത‌തി‌ക‌ളി‌ലെ നാ‌ല്‌ അ‌ടി‌മ‌ക‌ളെ മോ‌ചി‌പ്പി‌ക്കു‌ന്ന‌തി‌ലു‌മ‌ധി‌കം ഇ‌ഷ്ട‌മു‌ള്ള‌ത്‌. അ‌തു‌പോ‌ലെ, അ‌ല്ലാ‌ഹു‌വി‌ന്‌ ദി‌ക്‌‌റ്‌ ചൊ‌ല്ലി‌ക്കൊ‌ണ്ട്‌ വൈ‌കു‌ന്നേ‌രം -‌അ‌സ്വർ ന‌മ‌സ്‌‌കാ‌ര ശേ‌ഷം‌- സൂ‌ര്യൻ അ‌സ്‌‌ത‌മി‌ക്കു‌ന്ന‌തു‌വ‌രെ ഇ‌രി‌ക്കു‌ന്ന‌വ‌രെ പോ‌ലെ ദി‌ക്‌‌റ്‌ ചൊ‌ല്ലി ഇ‌രി‌ക്കു‌വാ‌നാ‌ണ്‌ എ‌നി‌ക്ക്‌ (മ‌റ്റു) നാ‌ല്‌ അ‌ടി‌മ‌ക‌ളെ മോ‌ചി‌പ്പി‌ക്കു‌ന്ന‌തി‌ലുമധി‌കം ഇ‌ഷ്ട‌മു‌ള്ള‌ത്‌.” (അബൂദാവൂദ്: 3667)</p>
            </p>}
            
            
            
          

          <p>ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌۭ وَلَا نَوْمٌۭ ۚ لَّهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍۢ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ</p>
          <button onClick={handleTranslationClick}>
            {showTranslation ? 'Hide Translation' : 'Show Translation'}
          </button>
          {showTranslation && <p>അ‌ല്ലാ‌ഹു‌-‌അ‌വ‌ന‌ല്ലാ‌തെ ആ‌രാ‌ധ‌ന‌ക്കർഹനില്ല. എ‌ന്നെ‌ന്നും ജീ‌വി‌ച്ചി‌രി‌ക്കു‌ന്ന‌വൻ. എ‌ല്ലാം നി‌യ‌ന്ത്രി‌ക്കു‌ന്ന‌വൻ. മ‌യ‌ക്ക‌മോ ഉ‌റ‌ക്ക‌മോ അ‌വ‌നെ ബാ‌ധി‌ക്കു‌ക‌യി‌ല്ല. അ‌വ‌ന്റേ‌താ‌ണ്‌ ആ‌കാ‌ശ‌ഭൂ‌മി‌ക‌ളി‌ലു‌ള്ള‌തെ‌ല്ലാം. അ‌വ‌ന്റെ അ‌നുവാ‌ദ‌പ്ര‌കാ‌ര‌മ‌ല്ലാ‌തെ അ‌വ‌ന്റെ‌യ‌ടു‌ക്കൽ ശു‌പാർ‌ശ ന‌ട‌ത്താ‌നാ‌രു‌ണ്ട്‌? അ‌വ‌രു‌ടെ മു‌മ്പി‌ലു‌ള്ള‌തും അ‌വർ‌ക്ക്‌ പി‌ന്നി‌ലു‌ള്ള‌തും (ക‌ഴി‌ഞ്ഞു‌പോ‌യ‌തും വ‌രാ‌നി‌രി‌ക്കു‌ന്ന‌തും) അ‌വൻ അ‌റി‌യു‌ന്നു. അ‌വ‌ന്റെ അ‌റി‌വിൽ‌നി‌ന്ന്‌ അ‌വൻ ഇ‌ച്ഛി‌ക്കു‌ന്ന‌ത‌ല്ലാ‌തെ മ‌റ്റൊ‌ന്നും അ‌വർ‌ക്ക്‌ സൂ‌ക്ഷ്‌‌മ‌മാ‌യി അ‌റി‌യാൻ ക‌ഴി‌യി‌ല്ല. അ‌വ‌ന്റെ പാ‌ദ‌പീഠം (കുർ‌സി) ആ‌കാ‌ശ ഭൂ‌മി‌ക‌ളെ മു‌ഴു‌വൻ ഉൾ‌കൊ‌ള്ളു‌ന്ന‌താ‌കു‌ന്നു. അ‌വ‌യു‌ടെ സം‌ര‌ക്ഷ‌ണം അ‌വ‌ന്ന്‌ ഒ‌ട്ടും ഭാ‌ര‌മു‌ള്ള‌ത‌ല്ല. അ‌വൻ ഉ‌ന്ന‌ത‌നും മ‌ഹാ‌നു‌മ‌ത്രെ.” (സൂ‌റഃ അൽ‌ബ‌ഖ‌റ‌- 255)</p>}
          <button onClick={handleReferenceClick}>
            {showReference ? 'Hide Reference' : 'Show Reference'}
          </button>
          {showReference && <p>ആ‌രെ‌ങ്കി‌ലും വൈ‌കു‌ന്നേ‌രം ആ‌യ‌തുൽ കുർ‌സി‌യ്യ്‌ ഓ‌തി‌യാൽ നേ‌രം‌പു‌ല‌രു‌ന്ന‌തു‌വ‌രേ‌യും രാ‌വി‌ലെ ഓ‌തി‌യാൽ വൈ‌കു‌ന്നേ‌രം വ‌രേ‌യും അ‌യാൾ‌ക്ക്‌ പൈ‌ശാ‌ചി‌ക ദ്രോ‌ഹത്തിൽ നി‌ന്ന്‌ സം‌ര‌ക്ഷ‌ണം ല‌ഭി‌ക്കും”  എന്ന്‌ ഉ‌ബ‌യ്യു‌ബ്‌‌നു ക‌അ‌ബ്‌ hൽ നി‌ന്ന്‌ നി‌വേ‌ദ‌നം ചെ‌യ്യ‌പ്പെ‌ട്ടി‌രി‌ക്കു‌ന്നു. (ഇ‌മാം മുൻ‌ദി‌രി‌യു‌ടെ സ്വ‌ഹീ‌ഹ്‌ തർ‌ഗീ‌ബ്‌ വ‌ത്തർ‌ഹീ‌ബ്‌: 662)</p>}
          
          <p>
            أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ ﴿﴾ بِسْمِ اللهِ الرَّحْمَٰنِ الرَّحِيمِ
            
قُلْ هُوَ اللهُ أَحَدٌ ﴿١﴾ اللهُ الصَّمَدُ ﴿٢﴾ لَمْ يَلِدْ وَلَمْ يُولَدْ ﴿٣﴾ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ ﴿٤﴾
<br />

بِسْمِ اللهِ الرَّحْمَٰنِ الرَّحِيمِ
قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴿١﴾ مِن شَرِّ مَا خَلَقَ ﴿٢﴾ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿٣﴾ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ﴿٤﴾ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾

<br />
بِسْمِ اللهِ الرَّحْمَٰنِ الرَّحِيمِ
قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴿١﴾ مَلِكِ النَّاسِ ﴿٢﴾ إِلَٰهِ النَّاسِ ﴿٣﴾ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ﴿٤﴾ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ﴿٥﴾ مِنَ الْجِنَّةِ وَالنَّاسِ ﴿٦﴾</p>
          <button onClick={handleTranslationClick}>
            {showTranslation ? 'Hide Translation' : 'Show Translation'}
          </button>
          {showTranslation && <p>Translation for Text 1</p>}
          <button onClick={handleReferenceClick}>
            {showReference ? 'Hide Reference' : 'Show Reference'}
          </button>
          {showReference && <p>Reference for Text 1</p>}
          
          <p>Text 2</p>
          <button onClick={handleTranslationClick}>
            {showTranslation ? 'Hide Translation' : 'Show Translation'}
          </button>
          {showTranslation && <p>Translation for Text 2</p>}
          <button onClick={handleReferenceClick}>
            {showReference ? 'Hide Reference' : 'Show Reference'}
          </button>
          {showReference && <p>Reference for Text 2</p>}
        </div>
      )}
    </div>
  );
};

export default Morning;

